# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

longe_name = ""

for i in names:
     if len(i) > len(longe_name):
         longe_name = i

print(longe_name)
